In [9]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [10]:
data = pd.read_csv('data.csv')

In [11]:
data

       City  Class_A  Class_B
0    Mumbai       51       62
1      Pune       56       76
2    Sangli       99       51
3  Kolhapur       73       66
4   Nagapur       75       54
5    Nashik       99       75

In [12]:
data['total_class'] = data['Class_A']+data['Class_B']

In [13]:
data['Class_A_Twt']=(data['Class_A']/data['total_class'])
data['Class_B_Twt']=(data['Class_B']/data['total_class'])

In [14]:
data['Class_A_Dwt']=(data['Class_A']/sum(data['Class_A']))
data['Class_B_Dwt']=(data['Class_B']/sum(data['Class_B']))

In [15]:
data = data.style.format(
{'Class_A_Twt': "{:.2%}",
'Class_B_Twt': "{:.2%}",
'Class_A_Dwt': "{:.2%}",
'Class_B_Dwt': "{:.2%}"})

In [16]:
data